; domain
(define (domain torch)

    (:requirements :typing :action-costs)

    (:types
        island guy - object
    )

    (:predicates
        (has-torch ?g - guy)
        (located ?g - guy ?i - island)
        (bridge ?i1 ?i2 - island)
    )

    (:functions
        (crossing-cost ?g) - number
        (pair-cost ?g1 ?g2) - number
        (total-cost) - number
    )

    (:action pass-torch
        :parameters (?g1 ?g2 - guy ?i - island)

        :precondition (and
            (located ?g1 ?i)
            (located ?g2 ?i)
            (has-torch ?g1)
            (not (has-torch ?g2))
        )

        :effect (and
            (not (has-torch ?g1))
            (has-torch ?g2)
        )
    )

    (:action cross
        :parameters (?g - guy ?i1 ?i2 - island)

        :precondition (and
            (located ?g ?i1)
            (bridge ?i1 ?i2)
            (has-torch ?g)
        )

        :effect (and
            (not (located ?g ?i1))
            (located ?g ?i2)
            (increase (total-cost) (crossing-cost ?g))
        )
    )

    (:action cross
        :parameters (?g1 ?g2 - guy ?i1 ?i2 - island)

        :precondition (and
            (not (= ?g1 ?g2))
            (located ?g1 ?i1)
            (located ?g2 ?i1)
            (bridge ?i1 ?i2)
            (has-torch ?g1)
        )

        :effect (and
            (not (located ?g1 ?i1))
            (not (located ?g2 ?i1))
            (located ?g1 ?i2)
            (located ?g2 ?i2)
            (increase (total-cost) (pair-cost ?g1 ?g2))
        )
    )
)

; problem
(define (problem p2)
    (:domain torch)

    (:objects
        l r - island
        a b c d e f - guy
    )

    (:init
        (bridge l r)
        (bridge r l)

        (has-torch a)
        (has-torch b)

        (located a l)
        (located b l)
        (located c l)
        (located d l)
        (located e l)
        (located f l)

        (= (crossing-cost a) 1)
        (= (crossing-cost b) 2)
        (= (crossing-cost c) 3)
        (= (crossing-cost d) 4)
        (= (crossing-cost e) 5)
        (= (crossing-cost f) 6)

        (= (pair-cost a a) 1)
        (= (pair-cost a b) 2)
        (= (pair-cost a c) 3)
        (= (pair-cost a d) 4)
        (= (pair-cost a e) 5)
        (= (pair-cost a f) 6)

        (= (pair-cost b a) 2)
        (= (pair-cost b b) 2)
        (= (pair-cost b c) 3)
        (= (pair-cost b d) 4)
        (= (pair-cost b e) 5)
        (= (pair-cost b f) 6)

        (= (pair-cost c a) 3)
        (= (pair-cost c b) 3)
        (= (pair-cost c c) 3)
        (= (pair-cost c d) 4)
        (= (pair-cost c e) 5)
        (= (pair-cost c f) 6)

        (= (pair-cost d a) 4)
        (= (pair-cost d b) 4)
        (= (pair-cost d c) 4)
        (= (pair-cost d d) 4)
        (= (pair-cost d e) 5)
        (= (pair-cost d f) 6)

        (= (pair-cost e a) 5)
        (= (pair-cost e b) 5)
        (= (pair-cost e c) 5)
        (= (pair-cost e d) 5)
        (= (pair-cost e e) 5)
        (= (pair-cost e f) 6)

        (= (pair-cost f a) 6)
        (= (pair-cost f b) 6)
        (= (pair-cost f c) 6)
        (= (pair-cost f d) 6)
        (= (pair-cost f e) 6)
        (= (pair-cost f f) 6)

    )

    (:goal
        (and
            (located a r)
            (located b r)
            (located c r)
            (located d r)
            (located e r)
            (located f r)
        )
    )

    (:metric minimize
        (total-cost)
    )

)

; plan
1. (pass-torch b e l)
   deleted: (has-torch b)
   added: (has-torch e)
   goals met: 0 of 6
2. (cross a b l r)
   deleted: (located a l) (located b l)
   added: (located a r) (located b r)
   goals met: 2 of 6
3. (cross e f l r)
   deleted: (located e l) (located f l)
   added: (located e r) (located f r)
   goals met: 4 of 6
4. (pass-torch e b r)
   deleted: (has-torch e)
   added: (has-torch b)
   goals met: 4 of 6
5. (cross a b r l)
   deleted: (located a r) (located b r)
   added: (located a l) (located b l)
   goals met: 2 of 6
6. (pass-torch b c l)
   deleted: (has-torch b)
   added: (has-torch c)
   goals met: 2 of 6
7. (cross c d l r)
   deleted: (located c l) (located d l)
   added: (located c r) (located d r)
   goals met: 4 of 6
8. (cross a b l r)
   deleted: (located a l) (located b l)
   added: (located a r) (located b r)
   goals met: 6 of 6
